app/controllers/songs_controller.rb

SELECT * FROM "songs"
---
  def view_playlist
	@songs = Song.all