app/controllers/songs_controller.rb

  def index
    @songs = Song.all
---
SELECT * FROM "songs"

  def show
    @song = Song.find(params[:id])
---
SELECT * FROM "songs" WHERE ("songs"."id" = 0)

  def edit
    @song = Song.find(params[:id])
---
SELECT * FROM "songs" WHERE ("songs"."id" = 3)

  def create
    @song = Song.new(params[:song])

    respond_to do |format|
      if @song.save
---
INSERT INTO "songs" ("artist", "created_at", "title", "updated_at", "album", "filename") VALUES('Artist 1', '2010-04-20 03:25:10', 'Song 1', '2010-04-20 03:25:10', 'Album 1', 'file1.mp3')

  def update
    @song = Song.find(params[:id])

    respond_to do |format|
      if @song.update_attributes(params[:song])
---
SELECT * FROM "songs" WHERE ("songs"."id" = 3)
UPDATE "songs" SET "updated_at" = '2010-04-20 03:56:23', "filename" = 'file3.mp3' WHERE "id" = 3

  def destroy
    @song = Song.find(params[:id])
    @song.destroy
---
SELECT * FROM "songs" WHERE ("songs"."id" = 2)
DELETE FROM "songs" WHERE "id" = 2

  def generate_playlist

	session[:current_track] = params[:id].to_i

	@songs = Song.all
---
SELECT * FROM "songs"

  def generate_player
	track_idx = params[:id].to_i

	@songs = Song.all
---
SELECT * FROM "songs"